import { CartSliderType } from "@/components/register/models";
import { ItemShowCaseType, Images } from "@/components/itemShowCase/models";
import { CommentsItemType } from "@/components/comments/models";
import home1 from "@/images/home1.jpg";
import home2 from "@/images/home2.jpg";
import home3 from "@/images/home3.jpg";
import home4 from "@/images/home4.jpg";
import home5 from "@/images/home5.jpg";

export const SLIDER_ITEMS: CartSliderType[] = [
  {
    image: home1.src,
    creator: "پارسا آقایی",
    date: "12 مرداد 1403",
    title: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی`,
  },
  {
    image: home2.src,
    creator: "زهرا مرادی",
    date: "15 شهریور 1403",
    title: `من برای اجاره یک آپارتمان مسکونی در مرکز شهر با Alpha Real Estate همکاری کردم و باید بگویم تجربه‌ای فراتر از انتظارم بود. تیم مشاوران بسیار دقیق و حرفه‌ای عمل کردند و تمامی گزینه‌های موجود را با جزئیات کامل معرفی کردند. آن‌ها نه تنها قیمت و موقعیت ملک را توضیح دادند، بلکه درباره شرایط قرارداد، امکانات محله و نکات حقوقی مرتبط نیز شفاف‌سازی کردند. همچنین هر زمان که سوال یا نگرانی داشتم، سریع پاسخگو بودند و حس کردم واقعاً به رضایت و آرامش مشتری اهمیت می‌دهند. بدون شک اگر دوباره قصد خرید یا اجاره ملک داشته باشم، اولین انتخابم همین مجموعه خواهد بود و آن را به دوستان و آشنایانم توصیه می‌کنم.`,
  },
  {
    image: home3.src,
    creator: "علی رضایی",
    date: "1 مهر 1403",
    title:  `به دنبال خرید یک ملک تجاری برای دفتر کارم بودم و ابتدا تصور می‌کردم پیدا کردن مکان مناسب بسیار زمان‌بر و سخت خواهد بود. اما با کمک تیم Alpha Real Estate این روند بسیار سریع، حرفه‌ای و بدون استرس پیش رفت. مشاوران با دانش کامل بازار، قیمت‌ها و موقعیت‌های مختلف، من را راهنمایی کردند و حتی گزینه‌هایی معرفی کردند که خودم اصلاً به آن‌ها فکر نکرده بودم. از ابتدا تا انتهای فرآیند، حس کردم یک همراه حرفه‌ای دارم که فقط به فکر من است و نه صرفاً فروش ملک. این تجربه باعث شد بیش از پیش به اهمیت یک مشاور متخصص و با تجربه پی ببرم و بدون شک در آینده نیز از خدمات آن‌ها استفاده خواهم کرد`
  },
  {
    image: home4.src,
    creator: "نسترن کاظمی",
    date: "20 آبان 1403",
    title: `تجربه اجاره ملک از طریق این مجموعه کاملاً متفاوت با دیگر دفاتر مشاور املاک بود. از همان ابتدا مشاوران با حوصله و صبر کامل توضیح دادند که چه گزینه‌هایی مناسب من هستند، مزایا و معایب هر ملک را با دقت بیان کردند و حتی نکات قانونی و قرارداد را قبل از امضا شفاف توضیح دادند. من احساس کردم که هدفشان فقط فروش یا اجاره نیست، بلکه رضایت کامل من برایشان مهم است. همچنین پیگیری‌های بعد از قرارداد باعث شد حس امنیت و اعتمادم به خدماتشان بیشتر شود. این تجربه باعث شد بفهمم مشاوره واقعی و تخصصی چقدر می‌تواند در تصمیم‌گیری درست موثر باشد`,
  },
  {
    image: home5.src,
    creator: "حسین احمدی",
    date: "7 آذر 1403",
    title: ` من برای خرید آپارتمان در تهران از خدمات Alpha Real Estate استفاده کردم و واقعا تجربه فوق‌العاده‌ای بود. تیم مشاوران حرفه‌ای و صبور بودند و با دقت تمامی گزینه‌ها را بررسی کردند. آن‌ها به نیازها و بودجه من کاملا احترام گذاشتند و راهنمایی‌های عملی ارائه دادند. بدون اغراق، پیدا کردن خانه مناسب در این شرایط سخت بازار بدون کمک آن‌ها تقریبا غیرممکن بود. هر مرحله از بازدید تا مذاکره با مالک با دقت و شفافیت انجام شد و حس کردم واقعا به مشتری اهمیت می‌دهند. قطعاً در آینده نیز برای خرید یا اجاره ملک دوباره به آن‌ها مراجعه خواهم کرد و به دوستان و خانواده‌ام توصیه می‌کنم.`,
  },
];

const IMAGES: Images[] = [
  { id: 1, image: home1.src },
  { id: 2, image: home2.src },
  { id: 3, image: home3.src },
  { id: 4, image: home4.src },
  { id: 5, image: home5.src },
];

export const HOT_DEALS_ITEMS: ItemShowCaseType[] = [
  {
    id: 1,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
  },
  {
    id: 2,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
  },
  {
    id: 3,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
  },
  {
    id: 4,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
  },
];


export const SEASONAL_DEALS_ITEMS: ItemShowCaseType[] = [
  {
    id: 1,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
    likes: 4.5,
    percent: 15,
    off: "2،500،000",
  },
  {
    id: 2,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
    likes: 4.5,
    percent: 15,
    off: "2،500،000",
  },
  {
    id: 3,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
    likes: 4.5,
    percent: 15,
    off: "2،500،000",
  },
  {
    id: 4,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
    likes: 4.5,
    percent: 15,
    off: "2،500،000",
  },
];

export const COMMENTS_ITEMS: CommentsItemType[] = [
  {
    id: 1,
    sender: "پارسا آقایی",
    date: "12 مرداد 1403",
    exp: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی`,
  },
  {
    id: 2,
    sender: "زهرا مرادی",
    date: "15 شهریور 1403",
    exp:  `به دنبال خرید یک ملک تجاری برای دفتر کارم بودم و ابتدا تصور می‌کردم پیدا کردن مکان مناسب بسیار زمان‌بر و سخت خواهد بود. اما با کمک تیم Alpha Real Estate این روند بسیار سریع، حرفه‌ای و بدون استرس پیش رفت. مشاوران با دانش کامل بازار، قیمت‌ها و موقعیت‌های مختلف، من را راهنمایی کردند و حتی گزینه‌هایی معرفی کردند که خودم اصلاً به آن‌ها فکر نکرده بودم. از ابتدا تا انتهای فرآیند، حس کردم یک همراه حرفه‌ای دارم که فقط به فکر من است و نه صرفاً فروش ملک. این تجربه باعث شد بیش از پیش به اهمیت یک مشاور متخصص و با تجربه پی ببرم و بدون شک در آینده نیز از خدمات آن‌ها استفاده خواهم کرد`
  },
  {
    id: 3,
    sender: "علی رضایی",
    date: "1 مهر 1403",
    exp:  `به دنبال خرید یک ملک تجاری برای دفتر کارم بودم و ابتدا تصور می‌کردم پیدا کردن مکان مناسب بسیار زمان‌بر و سخت خواهد بود. اما با کمک تیم Alpha Real Estate این روند بسیار سریع، حرفه‌ای و بدون استرس پیش رفت. مشاوران با دانش کامل بازار، قیمت‌ها و موقعیت‌های مختلف، من را راهنمایی کردند و حتی گزینه‌هایی معرفی کردند که خودم اصلاً به آن‌ها فکر نکرده بودم. از ابتدا تا انتهای فرآیند، حس کردم یک همراه حرفه‌ای دارم که فقط به فکر من است و نه صرفاً فروش ملک. این تجربه باعث شد بیش از پیش به اهمیت یک مشاور متخصص و با تجربه پی ببرم و بدون شک در آینده نیز از خدمات آن‌ها استفاده خواهم کرد`
  },
  {
    id: 4,
    sender: "نسترن کاظمی",
    date: "20 آبان 1403",
    exp: ` من برای خرید آپارتمان در تهران از خدمات Alpha Real Estate استفاده کردم و واقعا تجربه فوق‌العاده‌ای بود. تیم مشاوران حرفه‌ای و صبور بودند و با دقت تمامی گزینه‌ها را بررسی کردند. آن‌ها به نیازها و بودجه من کاملا احترام گذاشتند و راهنمایی‌های عملی ارائه دادند. بدون اغراق، پیدا کردن خانه مناسب در این شرایط سخت بازار بدون کمک آن‌ها تقریبا غیرممکن بود. هر مرحله از بازدید تا مذاکره با مالک با دقت و شفافیت انجام شد و حس کردم واقعا به مشتری اهمیت می‌دهند. قطعاً در آینده نیز برای خرید یا اجاره ملک دوباره به آن‌ها مراجعه خواهم کرد و به دوستان و خانواده‌ام توصیه می‌کنم.`,
  },
  {
    id: 5,
    sender: "حسین احمدی",
    date: "7 آذر 1403",
    exp: `تجربه اجاره ملک از طریق این مجموعه کاملاً متفاوت با دیگر دفاتر مشاور املاک بود. از همان ابتدا مشاوران با حوصله و صبر کامل توضیح دادند که چه گزینه‌هایی مناسب من هستند، مزایا و معایب هر ملک را با دقت بیان کردند و حتی نکات قانونی و قرارداد را قبل از امضا شفاف توضیح دادند. من احساس کردم که هدفشان فقط فروش یا اجاره نیست، بلکه رضایت کامل من برایشان مهم است. همچنین پیگیری‌های بعد از قرارداد باعث شد حس امنیت و اعتمادم به خدماتشان بیشتر شود. این تجربه باعث شد بفهمم مشاوره واقعی و تخصصی چقدر می‌تواند در تصمیم‌گیری درست موثر باشد`,
  },
];