import { CartSliderType } from "@/components/register/models";
import { ItemShowCaseType, Images } from "@/components/itemShowCase/models";
import { CommentsItemType } from "@/components/comments/models";
import home1 from "@/images/home1.jpg";
import home2 from "@/images/home2.jpg";
import home3 from "@/images/home3.jpg";
import home4 from "@/images/home4.jpg";
import home5 from "@/images/home5.jpg";

export const SLIDER_ITEMS: CartSliderType[] = [
  {
    image: home1.src,
    creator: "پارسا آقایی",
    date: "12 مرداد 1403",
    title: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی`,
  },
  {
    image: home2.src,
    creator: "زهرا مرادی",
    date: "15 شهریور 1403",
    title: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی`,
  },
  {
    image: home3.src,
    creator: "علی رضایی",
    date: "1 مهر 1403",
    title: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی`,
  },
  {
    image: home4.src,
    creator: "نسترن کاظمی",
    date: "20 آبان 1403",
    title: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی`,
  },
  {
    image: home5.src,
    creator: "حسین احمدی",
    date: "7 آذر 1403",
    title: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی`,
  },
];

const IMAGES: Images[] = [
  { id: 1, image: home1.src },
  { id: 2, image: home2.src },
  { id: 3, image: home3.src },
  { id: 4, image: home4.src },
  { id: 5, image: home5.src },
];

export const HOT_DEALS_ITEMS: ItemShowCaseType[] = [
  {
    id: 1,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
  },
  {
    id: 2,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
  },
  {
    id: 3,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
  },
  {
    id: 4,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
  },
];


export const SEASONAL_DEALS_ITEMS: ItemShowCaseType[] = [
  {
    id: 1,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
    likes: 4.5,
    percent: 15,
    off: "2،500،000",
  },
  {
    id: 2,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
    likes: 4.5,
    percent: 15,
    off: "2،500،000",
  },
  {
    id: 3,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
    likes: 4.5,
    percent: 15,
    off: "2،500،000",
  },
  {
    id: 4,
    banerTitle: "آپارتمان لوکس زعفرانیه",
    location: "تهران,زعفرانیه",
    bathroom: "2 حمام",
    yard: "حیاط دار",
    bed: "4 خواب",
    parking: "1 پارکینگ",
    images: IMAGES,
    price: "100،500،000",
    likes: 4.5,
    percent: 15,
    off: "2،500،000",
  },
];

export const COMMENTS_ITEMS: CommentsItemType[] = [
  {
    id: 1,
    sender: "پارسا آقایی",
    date: "12 مرداد 1403",
    exp: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی`,
  },
  {
    id: 2,
    sender: "زهرا مرادی",
    date: "15 شهریور 1403",
    exp: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی`,
  },
  {
    id: 3,
    sender: "علی رضایی",
    date: "1 مهر 1403",
    exp: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی`,
  },
  {
    id: 4,
    sender: "نسترن کاظمی",
    date: "20 آبان 1403",
    exp: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی`,
  },
  {
    id: 5,
    sender: "حسین احمدی",
    date: "7 آذر 1403",
    exp: `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی`,
  },
];